Tekla Open API Reference for Tekla Structures 2025
AnalysisPartAnalysisProperties.BuiltupEnum Enumeration
 The builtup settings.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum BuiltupEnum
Public Enumeration BuiltupEnum
Members
Member name | Value | Description
BUILTUP_AUTO | 9 |  The "auto" builtup setting.
BUILTUP_NONE | 0 |  The "none" builtup setting.
BUILTUP_MAIN_PART | 1 |  The "main part" builtup setting.
BUILTUP_SUB_PART | 2 |  The "sub part" builtup setting.
BUILTUP_SUB_PART_BEAM | 3 |  The "part beam" builtup setting.
BUILTUP_SUB_PART_COLUMN | 4 |  The "sub part column" builtup setting.
See Also
Reference
Tekla.Structures.Analysis Namespace